[
    {
        "id": 32414,
        "name": "Abdullah Al Mamun",
        "img": "https://randomuser.me/api/portraits/men/70.jpg",
        "review": "I love this camera. I've always been a fan of mirrorless, and this is one of the best (currently # 23 of all cameras rated by DXO). Yes, this baby has shortcomings, like dismal battery life, but it matches my FZ1000 (about 360 pictures on a fresh battery)—so not a flaw that is unheard of in top cameras, just far short of the competition. Some of the buttons could be better placed, and the dials (shutter speed/aperture) are too easily nudged and therefore accidentally changed. Built-in image stabilization is a must for me, and one of the main reasons that I bought this camera instead of the A7. However, it is only good for about 3 stops max, by my reckoning—not nearly as good as the stabilization on my FZ1000."
    },
    {
        "id": 32525,
        "name": "Mahfuz Hossain Ananto",
        "img": "https://randomuser.me/api/portraits/men/3.jpg",
        "review": "This is one of the best cameras on the market as of December 2018, value-per-dollar, and here's why: 1 - Look up some of the prices on the original FX (full frame) DSLRs. As of today, used, they are selling for the same price and feature half the resolution. 2 - It includes amazing features at this price, including image stabilization built into the camera. Yes, many of the lenses have it built in, but now you can adapt your old lenses from other camera models and take advantage of everything the A7II has to offer, including the 5-Axis stabilization and focus magnification. 3 - It is considered a professional mirrorless body. This means it's built in a way and has certain high quality parts that are often valued because they won't be seen in consumer models with cost-cutting efforts in mind."
    },
    {
        "id": 32636,
        "name": "Shahriar Soumik",
        "img": "https://randomuser.me/api/portraits/men/26.jpg",
        "review": "I was very let down when I first used this camera out of the box but then I popped a prime lens on it and it was AMAZING! Normally I think kit lenses are underrated and take too much abuse but this camera's kit lens is just horrible. Once I put a $198 50mm lens on the camera is was incredible. So this is one of the few times I found recommend you go for the body without the kit lens and buy yourself a good prime instead"
    },
    {
        "id": 32747,
        "name": "Shahriar Rahman Heezol",
        "img": "https://randomuser.me/api/portraits/men/31.jpg",
        "review": "It may not be the newest fancy model, but the colour quality is great. The camera boots up quickly and focusses quickly as well even in fairly low light. Also by using adapters, I can use 35mm full frame glass and APS-c smaller frame lens I have collected over the years. The 5 axis stabilization works perfectly with current Sony E-mount lenses and 3 axis (more basic) is the default stability for all other glass including everything from screw mount 50 year old glass to Minolta 20 year old glass with AF. Great addition to my kit."
    },
    {
        "id": 32858,
        "name": "Tanvir Eshtiaque Tamim",
        "img": "https://randomuser.me/api/portraits/men/92.jpg",
        "review": "Sony has very nice cameras; this model, I think, is a good deal for photographers, not videographers... I wasn't sure that I want to switch from Nikon, but I like the concept of using same lenses for a6000 series and A7 series :-)"
    },
    {
        "id": 32969,
        "name": "Musaddek Hossen Tahmid",
        "img": "https://randomuser.me/api/portraits/men/25.jpg",
        "review": "Excellent camera, I’ve really grown to love it. Keep in mind the battery life isn’t the best I would suggest a battery grip for anyone that is more then occasional shooter."
    },
    {
        "id": 32749,
        "name": "Rabiul Islam Wazed",
        "img": "https://randomuser.me/api/portraits/men/1.jpg",
        "review": "Still learning how to use all the options. I was able to buy some old glass lenses for about $30 (28mm, 50mm) and take some outstanding portraits and landscapes. Very versatile."
    },
    {
        "id": 32850,
        "name": "Takibul Hasan Tonmoy",
        "img": "https://randomuser.me/api/portraits/men/59.jpg",
        "review": "The under $1K price tag for this camera is just a great deal. Yes, Sony makes the A7iii but that's $2K plus camera.The A7ii though is a very fine 24.3 mp camera with intuitive menu and nice options. Lot's of great videos on Youtube to learn the ins and outs of the a7ii. I shoot in RAW and finishing in Lightroom. Gave 4 stars instead of 5 due to short battery life and overall picture quality. Solved the battery issue by purchasing a $50 attachable battery grip that holds 2 batteries. The grip also functions as Portrait shooter with extra shutter button on rotation. Picture quality is quite good but I'm puzzled how in some cases, my 12mp iPhone 8 Plus takes better photos. Not sure what to make of that exactly but that is probably why Sony developed a better sensor for the A7iii. Anyway, if you're getting started into mirrorless digital photography, this is a wonderful starter camera."
    },
    {
        "id": 32205,
        "name": "Sadi Mohammad Sayeem",
        "img": "https://randomuser.me/api/portraits/men/82.jpg",
        "review": "I have used many different DSLR's. Happy with FF mirrorless now that it's affordable. Camera is decent size, not huge, it has a big sensor. Takes great low iso with great dynamic range photos. Really remarkable for an older model. High iso is decent, the PDAF is good. Perhaps not top of the line anymore, but for the price your getting a true beast, a true semi-pro camera for the price of a typical APSC camera. This is the future, apsc was always about compromise, but Sony and Canon have busted that bubble. I also use M43 too, it's a great combo."
    }
]